import {
  bed11Img,
  bed12Img,
  bed13Img,
  bed14Img,
  bed15Img,
  bed16Img,
  bed17Img,
  bed18Img,
  bed19Img,
  bed21Img,
  bed22Img,
  bed23Img,
  bed24Img,
  bed25Img,
  bed26Img,
  bed27Img,
  bed28Img,
  bed29Img,
  bed210Img,
  bed211Img,
  bed212Img,
  bedVid,
  poster,
  wheelchair1Img,
  wheelchair2Img,
  wheelchair3Img,
  bedVid2,
  poster2,
} from 'shared/assets/images';
import { Product } from 'shared/assets/types/product';

export const products: Product[] = [
  {
    id: 1,
    name: 'Многофункциональная медицинская кровать с электроприводом',
    price: '3 999 ₽ / мес',
    description:
      'Современная функциональная кровать с электроприводом — отличный выбор для ухода за лежачими больными и людьми с ограниченной подвижностью на дому.Оснащена дистанционным управлением, функцией переворота и трансформацией в кардио-кресло. В комплект входят: санитарное устройство, боковые ограждения, штанга для подтягивания и инфузионная стойка. Подходит для реабилитации, облегчает уход и снижает риск образования пролежней. Максимальная нагрузка: до 200 кг.',
    media: [
      {
        type: 'image',
        src: bed11Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Севастополь',
      },
      {
        type: 'image',
        src: bed12Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Севастополь',
      },
      { type: 'video', src: bedVid, poster: poster },
      {
        type: 'image',
        src: bed13Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Севастополь',
      },
      {
        type: 'image',
        src: bed14Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Севастополь',
      },
      {
        type: 'image',
        src: bed15Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Севастополь',
      },

      {
        type: 'image',
        src: bed16Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Севастополь',
      },
      {
        type: 'image',
        src: bed17Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Севастополь',
      },
      {
        type: 'image',
        src: bed18Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Севастополь',
      },
      {
        type: 'image',
        src: bed19Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Севастополь',
      },
    ],
  },
  {
    id: 2,
    name: 'Медицинская кровать с функцией переворачивания и положением кардио-кресла',
    price: '3 999 ₽ / мес',
    description:
      'Функциональная кровать с механическим управлением и удобной комплектацией для длительного ухода за пациентом. Оснащена механизмом ручного переворачивания и положением "кардио-кресло", что улучшает вентиляцию лёгких и снижает давление на органы. В комплект входят: туалетное устройство, жёсткий матрас, надкроватный столик, боковые алюминиевые ограждения, самоориентирующиеся колёса с тормозами и штанга для подтягивания. Надёжное решение для домашнего использования.',
    media: [
      {
        type: 'image',
        src: bed21Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed22Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      { type: 'video', src: bedVid2, poster: poster2 },
      {
        type: 'image',
        src: bed23Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed24Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed25Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed26Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed27Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed28Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed29Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed210Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed211Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed212Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
    ],
  },
  {
    id: 3,
    name: 'Инвалидное кресло-коляска стандартное',
    price: '1 499 ₽ / мес',
    media: [
      {
        type: 'image',
        src: wheelchair1Img,
        altLabel: 'Инвалидное кресло-коляска стандартное',
      },
      {
        type: 'image',
        src: wheelchair2Img,
        altLabel: 'Инвалидное кресло-коляска стандартное',
      },
      {
        type: 'image',
        src: wheelchair3Img,
        altLabel: 'Инвалидное кресло-коляска стандартное',
      },
    ],
  },
];
